export const ua = {
  Contacts: "Контакти",
  Individual_projects: "Індивідуальні проекти",
  Catalogue: "Каталог",
  Projects: "Проєкти",
  About_us: "Про нас",
  About_the_company: "Про компанію",
  Career: "Кар'єра",
  Main_title:
    "Виробництво мяких меблів для готелів, ресторанів, кафе та індивідуальних просторів",
  Main_catalogue_btn: "Каталог",
  Our_advantages: "НАШІ ПЕРЕВАГИ",
  Advantages_title:
    "Які наші основні метрики, завдяки яким ми маємо велику кількість задоволених клієнтів? ",
  Product_reliability: "Надійність продукту",
  Product_reliability_text:
    "Наші меблі випробувані тисячами людей та роками вашої довіри. Надійність продукту є основним правилом нашої компанії",
  Unity: "Єдність",
  Unity_text:
    "Єдність команди - це важливий момент у злагодженій праці та ідеального виробу на фініші робочого процесу, який буде довго радувати своїх власників",
  High_quality: "Висока якість матеріалів",
  High_quality_text:
    "Ми обираємо лише сертифіковані матеріали для виробництва, щоб забезпечити високу якість продукції та довгу експлуатацію",
  Time: "Час",
  Time_text:
    "Для нас є важливим виконання замовлення вчасно та швидко, щоб ви скоріше отримали комфорті меблі для гостинного простору",
  Personal_approach: "Особистий підхід до кожного клієнта",
  Personal_approach_text:
    "Ми працюємо з особистими запитами наших клієнтів, щоб максимально задовольнити кожну вашу ідею та запит",
  Innovation: "Інновації",
  Innovation_text:
    "Нові технології у нашому виробництві є невідємною частниною запоруки успіху у досяганні якості та надійності наших виробів",
  Professional_team: "Професійний колектив",
  Professional_team_text:
    "В нашій команді працюють професіонали, які здатні втілити будь-яку вашу ідею в життя швидко та якісно",
  to_the_catalogue: "ДО КАТАЛОГУ",
};
