"use client";

import React, { useEffect } from "react";

const SVG_STYLES = `
  /* Анимация прорисовки линий */
  .lines path {
    stroke-dasharray: 500;
    stroke-dashoffset: 500;
    animation: drawLine 5s ease forwards;
  }

  /* Поочередная задержка для таймлайна */
  .lines path:nth-child(1) { animation-delay: 0s; }
  .lines path:nth-child(2) { animation-delay: 0.5s; }
  .lines path:nth-child(3) { animation-delay: 0.6s; }
  .lines path:nth-child(4) { animation-delay: 0.7s; }
  .lines path:nth-child(5) { animation-delay: 0.8s; }
  .lines path:nth-child(6) { animation-delay: 0.9s; }
  .lines path:nth-child(7) { animation-delay: 1s; }
  .lines path:nth-child(8) { animation-delay: 1.1s; }
  .lines path:nth-child(9) { animation-delay: 1.2s; }
  .lines path:nth-child(10) { animation-delay: 1.3s; }
  .lines path:nth-child(11) { animation-delay: 1.4s; }
  .lines path:nth-child(12) { animation-delay: 1.5s; }
  .lines path:nth-child(13) { animation-delay: 1.6s; }
  .lines path:nth-child(14) { animation-delay: 1.7s; }
  .lines path:nth-child(15) { animation-delay: 1.8s; }

  @keyframes drawLine {
    to {
      stroke-dashoffset: 0;
    }
  }

  /* Появление заливки */
  .fills path {
    animation: fillAppear 1.3s ease forwards;
    animation-delay: 2.3s; /* после всех линий */
  }

  @keyframes fillAppear {
    to {
      opacity: 1;
    }
  }
`;

const SplashScreen = ({ isComplete }) => {
  useEffect(() => {
    const timeout = setTimeout(() => {
      isComplete();
    }, 3400);

    return () => {
      clearTimeout(timeout);
    };
  }, [isComplete]);

  return (
    <div className="splash-screen-container">
      <svg
        xmlns="http://www.w3.org/2000/svg"
        width="226.5"
        height="234"
        viewBox="0 0 151 156"
        fill="none"
      >
        <style dangerouslySetInnerHTML={{ __html: SVG_STYLES }} />
        <g class="lines">
          <path
            d="M58.1651 51.9556L63.9434 69.2749V75.0481L75.4999 80.8212L87.0564 75.0481V69.2749L92.8347 51.9556L98.613 69.2749L110.17 63.5018V11.5462C110.17 5.16714 94.6492 0 75.5024 0C56.3556 0 40.8354 5.16714 40.8354 11.5462V63.5018L52.3919 69.2749L58.1702 51.9556H58.1651ZM43.7195 11.5462C43.7195 10.6109 45.4308 8.27246 51.8961 6.12011C58.1601 4.03565 66.5431 2.88656 75.4999 2.88656C84.4567 2.88656 92.8397 4.03565 99.1037 6.12011C105.569 8.27246 107.28 10.6109 107.28 11.5462C107.28 12.4816 105.569 14.82 99.1037 16.9724C92.8397 19.0568 84.4567 20.2059 75.4999 20.2059C66.5431 20.2059 58.1601 19.0568 51.8961 16.9724C45.4308 14.82 43.7195 12.4816 43.7195 11.5462Z"
            stroke="#38393F"
            stroke-width="0.9"
            fill="transparent"
          />

          <path
            d="M34.9565 115.455V98.1305H26.7698L17.8205 109.84L8.87124 98.1305H0.531006V115.455H7.39396V106.26L14.2594 115.455H21.2281L28.0935 106.285V115.455H34.9565Z"
            stroke="#38393F"
            stroke-width="0.9"
            fill="transparent"
          />

          <path
            d="M67.1018 115.455L56.4488 98.1305H47.2705L36.6174 115.455H44.8545L46.5079 112.583H57.1106L58.7641 115.455H67.1043H67.1018ZM49.2008 107.884L51.8206 103.388L54.4153 107.884H49.2008Z"
            stroke="#38393F"
            stroke-width="0.9"
            fill="transparent"
          />

          <path
            d="M86.1404 98.1305L79.1994 109.84L72.2333 98.1305H63.8931L74.5461 115.455H83.7269L94.38 98.1305H86.1404Z"
            stroke="#38393F"
            stroke-width="0.9"
            fill="transparent"
          />

          <path
            d="M96.2549 115.455H119.952V110.119H103.12V108.927H119.469V104.608H103.12V103.464H119.952V98.1305H96.2549V115.455Z"
            stroke="#38393F"
            stroke-width="0.9"
            fill="transparent"
          />

          <path
            d="M130.129 105.319L142.841 115.455H150.469V98.1305H143.606V107.987L131.07 98.1305H123.264V115.455H130.129V105.319Z"
            stroke="#38393F"
            stroke-width="0.9"
            fill="transparent"
          />

          <path
            d="M13.9348 126.81C17.9262 126.81 21.7666 127.471 24.842 128.004L26.0626 122.339C22.5015 121.527 18.5353 120.969 14.4432 120.969C3.68692 120.969 0 124.296 0 129.91C0 135.525 3.68692 138.877 14.4432 138.877C18.5378 138.877 22.504 138.319 26.0626 137.504V129.732H18.9429V132.83C17.3398 132.955 15.6386 133.033 13.9348 133.033C7.90737 133.033 6.86547 132.118 6.86547 129.908C6.86547 127.698 7.90737 126.808 13.9348 126.808V126.81Z"
            stroke="#38393F"
            stroke-width="0.9"
            fill="transparent"
          />

          <path
            d="M50.3234 133.848L50.7815 133.798C54.4432 133.39 56.9096 131.537 56.9096 127.6C56.9096 122.621 53.4768 121.223 49.1809 121.223H31.2295V138.547H38.095V134.23H42.8741L48.3655 138.547H56.9347L51.544 134.482L50.3234 133.848ZM48.4158 129.148H38.0924V127.067H48.4158C49.3822 127.067 49.7874 127.245 49.7874 128.133C49.7874 128.894 49.3797 129.148 48.4158 129.148Z"
            stroke="#38393F"
            stroke-width="0.9"
            fill="transparent"
          />

          <path
            d="M60.5886 129.883C60.5886 136.056 64.8871 138.927 75.286 138.927C85.6848 138.927 89.9833 136.056 89.9833 129.883C89.9833 123.71 85.6873 120.838 75.286 120.838C64.8846 120.838 60.5886 123.71 60.5886 129.883ZM82.9895 129.883C82.9895 132.422 81.4644 133.084 75.286 133.084C69.1076 133.084 67.4541 132.422 67.4541 129.883C67.4541 127.343 69.1076 126.682 75.286 126.682C81.4644 126.682 82.9895 127.343 82.9895 129.883Z"
            stroke="#38393F"
            stroke-width="0.9"
            fill="transparent"
          />

          <path
            d="M107.207 138.852C115.014 138.852 120.176 136.616 120.176 130.773V121.221H113.31V129.274C113.31 132.246 111.556 133.008 107.207 133.008C102.859 133.008 101.104 132.246 101.104 129.274V121.221H94.239V130.773C94.239 136.616 99.4007 138.852 107.207 138.852Z"
            stroke="#38393F"
            stroke-width="0.9"
            fill="transparent"
          />

          <path
            d="M143.271 121.221H125.32V138.545H132.186V135.243H143.271C147.567 135.243 151 133.363 151 127.851C151 122.669 147.567 121.221 143.271 121.221ZM142.408 129.4H132.188V127.062H142.408C143.299 127.062 143.883 127.24 143.883 128.231C143.883 129.121 143.299 129.4 142.408 129.4Z"
            stroke="#38393F"
            stroke-width="0.9"
            fill="transparent"
          />
        </g>

        <g class="fills">
          <path
            d="M58.1651 51.9556L63.9434 69.2749V75.0481L75.4999 80.8212L87.0564 75.0481V69.2749L92.8347 51.9556L98.613 69.2749L110.17 63.5018V11.5462C110.17 5.16714 94.6492 0 75.5024 0C56.3556 0 40.8354 5.16714 40.8354 11.5462V63.5018L52.3919 69.2749L58.1702 51.9556H58.1651ZM43.7195 11.5462C43.7195 10.6109 45.4308 8.27246 51.8961 6.12011C58.1601 4.03565 66.5431 2.88656 75.4999 2.88656C84.4567 2.88656 92.8397 4.03565 99.1037 6.12011C105.569 8.27246 107.28 10.6109 107.28 11.5462C107.28 12.4816 105.569 14.82 99.1037 16.9724C92.8397 19.0568 84.4567 20.2059 75.4999 20.2059C66.5431 20.2059 58.1601 19.0568 51.8961 16.9724C45.4308 14.82 43.7195 12.4816 43.7195 11.5462Z"
            fill="#38393F"
            opacity="0"
          />
        </g>
      </svg>
    </div>
  );
};

export default SplashScreen;
